""""

ให้นักศึกษาเขียนฟังก์ชันที่ทำงานเหมือนกับฟังก์ชัน len() เพื่อหาความยาวของ string และแสดงผลดังตัวอย่าง(print ตัวอักษรตามด้วยเครื่องหมายพิเศษสลับกันคู่คี่)

****ห้ามใช้คำสั่ง len, for, while, do while, split*****

หมายเหตุ ฟังก์ชันต้องมี parameter แค่เพียง 1 ตัว

def length(txt):     
    #Code Here
print("\n",length(input("Enter Input : ")),sep="")
#ตรง print(เป็นแค่ตัวอย่างสามารถแก้ไขได้)

Enter Input : hello
h*e~l*l~o*
5

Enter Input : data structure is easy
d*a~t*a~ *s~t*r~u*c~t*u~r*e~ *i~s* ~e*a~s*y~
22

Enter Input : *~*~*~
**~~**~~**~~
6

"""
def length(txt):
    n = 0
    # สร้าง n เพื่อมาเก็บค่าขนาดของตัวอักษรแต่ละรอบ
    if txt == '':
        return 0
    else:
        n = length(txt[:-1])
        # ก็เอา n มาเก็บจำนวนอักษรของแต่ละรอบ โดยจะลดขนาดของอักษร โดยตัดตัวสุดท้าย [:-1] จะเป็น hello , hell , hel, ... ,h , '' 
        if int(n) % 2 == 0:
            print(txt[-1]+'*',end="")   
            # ปริ้น txt[-1] คือปริ้นตัวสุดท้ายก่อน เพราะว่าเราทำการเรียกฟังก์ชันซ้ำก่อน 
            # ดังนั้นฟังชันก์ที่เรียกครั้งสุดท้ายจะเป็น h , he , hell ,...,hello
        else:
            print(txt[-1]+'~',end="")
        # ไว้เช็คว่าขนาดของแต่ละรอบเป็นคู่หรือคี่ก็ให้ปริ้นตามคู่หรือคี่ 
        return n+1     
        # รีเทิร์นค่าขนาดของแต่ละรอบ โดยจะเป็น 0 , 0+1 , (0+1)+1 ,... , จนจบ จะมีค่า เท่ากับ จำนวนของ txt4
        # เป็นแบบนี้ก็เพราะว่าเราเรียกฟังก์ชันซ้ำก่อน  
    # txt =     hello ,  hell ,  hel  ,       he     ,      h         ,           ''
    # length =    0   ,  0+1 , (0+1)+1 , ((0+1)+1)+1  , (((0+1)+1)+1)+1 , ((((0+1)+1)+1)+1)+1
print("\n",length(input("Enter Input : ")),sep="")
#ตรง print(เป็นแค่ตัวอย่างสามารถแก้ไขได้)